OpenROAD 24Q3-12208-gbbf699543a 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /workspaces/ece4203_code/openroad_flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/adder64_pipelined/base/2_2_floorplan_macro.odb
source /workspaces/ece4203_code/openroad_flow/platforms/sky130hd/setRC.tcl
[INFO TAP-0005] Inserted 1625 tapcells.
write_db ./results/sky130hd/adder64_pipelined/base/2_3_floorplan_tapcell.odb
Elapsed time: 0:00.66[h:]min:sec. CPU time: user 0.58 sys 0.07 (98%). Peak memory: 117360KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_3_floorplan_tapcell              0            114 4758b87cc837a3c1b0bc
