OpenROAD 24Q3-12208-gbbf699543a 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /workspaces/ece4203_code/openroad_flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/adder64_pipelined/base/2_3_floorplan_tapcell.odb
source /workspaces/ece4203_code/openroad_flow/platforms/sky130hd/setRC.tcl
[INFO PDN-0001] Inserting grid: grid
write_db ./results/sky130hd/adder64_pipelined/base/2_4_floorplan_pdn.odb
Elapsed time: 0:00.87[h:]min:sec. CPU time: user 0.78 sys 0.09 (99%). Peak memory: 126644KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_4_floorplan_pdn                  0            123 560e08e39276c110534c
