OpenROAD 24Q3-12208-gbbf699543a 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /workspaces/ece4203_code/openroad_flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/adder64_pipelined/base/5_2_route.odb
source /workspaces/ece4203_code/openroad_flow/platforms/sky130hd/setRC.tcl
filler_placement "sky130_fd_sc_hd__fill_1 sky130_fd_sc_hd__fill_2 sky130_fd_sc_hd__fill_4 sky130_fd_sc_hd__fill_8"
[INFO DPL-0001] Placed 10753 filler instances.
write_db ./results/sky130hd/adder64_pipelined/base/5_3_fillcell.odb
Elapsed time: 0:00.81[h:]min:sec. CPU time: user 0.71 sys 0.10 (99%). Peak memory: 138968KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
5_3_fillcell                       0            135 9fd651139ff90c9ccd98
